[
    {\n    "timecode": "00:00",\n    "chapterSummary": "A woman is talking about the case of a missing woman, Revelle Balmain, who disappeared in 1994. She was a model and worked as an escort. She said that Revelle\'s possessions were found after she disappeared, and that this was concerning. A news segment on the 60 Minutes Australia program shows a picture of Revelle Balmain from 1994. "\n  },
    {\n    "timecode": "00:16",\n    "chapterSummary": "The 60 Minutes Australia program highlights the new evidence in the Revelle Balmain case, focusing on Jane King, the former owner of the escort agency Revelle worked for. Jane King states that there is new evidence in the case. It is reported that Jane King\'s ex-husband, Zoran, told police that he was home the night Revelle went missing, but Jane states that Zoran\'s alibi does not match the phone records. "\n  },
    {\n    "timecode": "00:32",\n    "chapterSummary": " Jane King, the former owner of the escort agency Revelle worked for, states there is new evidence that indicates Zoran is not telling the truth about his whereabouts. The 60 Minutes Australia program shows pictures of Revelle Balmain, including her first magazine cover. Jane King says that Zoran\'s story does not match the phone records. "\n  },
    {\n    "timecode": "00:48",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the new evidence in the Revelle Balmain case. It is reported that Zoran has changed his story several times. Detective Chief Inspector Stuart Bell, leading the investigation, says that they are hoping that someone who knows Zoran will come forward and provide information. "\n  
    {\n    "timecode": "01:04",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open. This is followed by a 60 Minutes Australia program segment about the conviction of Danny Masterson, who was a Scientologist and a former co-star on That 70s Show. "\n  },
    {\n    "timecode": "01:20",\n    "chapterSummary": "The 60 Minutes Australia program highlights the new developments in the Revelle Balmain case. Jane King reveals that her ex-husband, Zoran, booked Revelle with a client named Boyan the night Revelle went missing. The 60 Minutes Australia program shows pictures of Revelle Balmain from 1994 and a news segment about the case. "\n  },
   {\n    "timecode": "01:36",\n    "chapterSummary": "The 60 Minutes Australia program focuses on the Revelle Balmain case. Revelle Balmain disappeared in 1994 and the case remained unsolved for nearly 30 years. However, there is new hope with new clues and persons of interest.  "\n  },
    {\n    "timecode": "01:52",\n    "chapterSummary": "The 60 Minutes Australia program shares details about the disappearance of Revelle Balmain. It is reported that the last person to be with Revelle was her client, Gavin Sema.  The program shares more information about Gavin Sema, including the fact that he was the main driver for the escort agency. The program shares more information about the case and the new evidence that has come to light. "\n  },
    {\n    "timecode": "02:08",\n    "chapterSummary": "The 60 Minutes Australia program investigates the case of Revelle Balmain. It is reported that the new evidence has changed the focus of the investigation.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "02:24",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. The program shares details of the case and new evidence that has come to light. The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "02:40",\n    "chapterSummary": "The 60 Minutes Australia program examines the Revelle Balmain case, focusing on the new evidence that has come to light. The program shares details about the case and the new evidence that has come to light. The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "02:56",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. Jane King, the former owner of the escort agency Revelle worked for, shares more details about the case and the new evidence that has come to light. It is reported that Zoran has changed his story multiple times, and that there are inconsistencies in his alibi. "\n  },\n  {\n    "timecode": "03:12",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. Jane King discusses the new evidence that has come to light, which has changed the focus of the investigation.  The program shares details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "03:28",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. The program shares details about the case and the new evidence that has come to light. The program shares more details about the case and the new evidence that has come to light.  "\n  },\n  {\n    "timecode": "03:44",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. Jane King shares details about the case and the new evidence that has come to light. The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "04:00",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. Jane King shares details about the case and the new evidence that has come to light.  It is reported that Zoran, Jane\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for. "\n  },\n  {\n    "timecode": "04:16",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. It is reported that Zoran has changed his story several times, and that there are inconsistencies in his alibi. The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "04:32",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. Jane King, the former owner of the escort agency Revelle worked for, shares more details about the case and the new evidence that has come to light.  It is reported that Zoran has changed his story several times, and that there are inconsistencies in his alibi. "\n  },\n  {\n    "timecode": "04:48",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for. The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "05:04",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. Jane King discusses the new evidence that has come to light, which has changed the focus of the investigation. Jane King\'s sister, Suellen Simpson, who has lived with the grief and uncertainty of the case, says that the new evidence has re-ignited hope for answers. "\n  },\n  {\n    "timecode": "05:20",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for. The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "05:36",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "05:52",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. Jane King, the former owner of the escort agency Revelle worked for, shares more details about the case and the new evidence that has come to light. It is reported that Zoran has changed his story multiple times, and that there are inconsistencies in his alibi. "\n  },\n  {\n    "timecode": "06:08",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "06:24",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. The program shares details about the case and the new evidence that has come to light.  "\n  },\n  {\n    "timecode": "06:40",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. Jane King discusses the new evidence that has come to light, which has changed the focus of the investigation. Jane King\'s sister, Suellen Simpson, who has lived with the grief and uncertainty of the case, says that the new evidence has re-ignited hope for answers. "\n  },\n  {\n    "timecode": "06:56",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain.  It is reported that Zoran, Jane\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "07:12",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. Jane King, the former owner of the escort agency Revelle worked for, shares more details about the case and the new evidence that has come to light.  It is reported that Zoran has changed his story multiple times, and that there are inconsistencies in his alibi. "\n  },\n  {\n    "timecode": "07:28",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "07:44",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. The program shares details about the case and the new evidence that has come to light. Jane King reveals that Zoran, her ex-husband, booked Revelle with a client named Boyan the night Revelle went missing. "\n  },\n  {\n    "timecode": "08:00",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. The program shares details about the case and the new evidence that has come to light. Jane King reveals that Zoran, her ex-husband, booked Revelle with a client named Boyan the night Revelle went missing. "\n  },\n  {\n    "timecode": "08:16",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. It is reported that Zoran has changed his story several times, and that there are inconsistencies in his alibi.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "08:32",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. Jane King discusses the new evidence that has come to light, which has changed the focus of the investigation. Jane King\'s sister, Suellen Simpson, who has lived with the grief and uncertainty of the case, says that the new evidence has re-ignited hope for answers. "\n  },\n  {\n    "timecode": "08:48",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain.  It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for. The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "09:04",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "09:20",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "09:36",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. The program shares details about the case and the new evidence that has come to light.  It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for. "\n  },\n  {\n    "timecode": "09:52",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "10:08",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "10:24",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "10:40",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for. The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "10:56",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for. The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "11:12",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. Jane King discusses the new evidence that has come to light, which has changed the focus of the investigation. Jane King\'s sister, Suellen Simpson, who has lived with the grief and uncertainty of the case, says that the new evidence has re-ignited hope for answers. "\n  },\n  {\n    "timecode": "11:28",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "11:44",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "12:00",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "12:16",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "12:32",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. The program shares details about the case and the new evidence that has come to light.  It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for. "\n  },\n  {\n    "timecode": "12:48",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "13:04",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. Jane King reveals that Zoran, her ex-husband, booked Revelle with a client named Boyan the night Revelle went missing. "\n  },\n  {\n    "timecode": "13:20",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. Jane King discusses the new evidence that has come to light, which has changed the focus of the investigation. Jane King\'s sister, Suellen Simpson, who has lived with the grief and uncertainty of the case, says that the new evidence has re-ignited hope for answers. "\n  },\n  {\n    "timecode": "13:36",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "13:52",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. Jane King, the former owner of the escort agency Revelle worked for, shares more details about the case and the new evidence that has come to light.  It is reported that Zoran has changed his story multiple times, and that there are inconsistencies in his alibi. "\n  },\n  {\n    "timecode": "14:08",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for. The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "14:24",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for. The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "14:40",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain.  It is reported that Zoran, Jane\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "14:56",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. Jane King reveals that Zoran, her ex-husband, booked Revelle with a client named Boyan the night Revelle went missing. "\n  },\n  {\n    "timecode": "15:12",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. The program shares details about the case and the new evidence that has come to light.  It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for.  "\n  },\n  {\n    "timecode": "15:28",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. The program shares details about the case and the new evidence that has come to light. It is reported that Zoran has changed his story multiple times, and that there are inconsistencies in his alibi. "\n  },\n  {\n    "timecode": "15:44",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for. The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "16:00",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "16:16",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for.  The program shares more details about the case and the new evidence that has come to light.  "\n  },\n  {\n    "timecode": "16:32",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. The program shares details about the case and the new evidence that has come to light.  It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for. "\n  },\n  {\n    "timecode": "16:48",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "17:04",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "17:20",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. Jane King discusses the new evidence that has come to light, which has changed the focus of the investigation. Jane King\'s sister, Suellen Simpson, who has lived with the grief and uncertainty of the case, says that the new evidence has re-ignited hope for answers. "\n  },\n  {\n    "timecode": "17:36",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "17:52",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. Jane King discusses the new evidence that has come to light, which has changed the focus of the investigation. Jane King\'s sister, Suellen Simpson, who has lived with the grief and uncertainty of the case, says that the new evidence has re-ignited hope for answers. "\n  },\n  {\n    "timecode": "18:08",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "18:24",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "18:40",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. Jane King discusses the new evidence that has come to light, which has changed the focus of the investigation. Jane King\'s sister, Suellen Simpson, who has lived with the grief and uncertainty of the case, says that the new evidence has re-ignited hope for answers. "\n  },\n  {\n    "timecode": "18:56",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for.  The program shares more details about the case and the new evidence that has come to light.  "\n  },\n  {\n    "timecode": "19:12",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. Jane King discusses the new evidence that has come to light, which has changed the focus of the investigation. Jane King\'s sister, Suellen Simpson, who has lived with the grief and uncertainty of the case, says that the new evidence has re-ignited hope for answers. "\n  },\n  {\n    "timecode": "19:28",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open.  The program shares more details about the case and the new evidence that has come to light.  "\n  },\n  {\n    "timecode": "19:44",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open.  The program shares more details about the case and the new evidence that has come to light.  "\n  },\n  {\n    "timecode": "19:56",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. The program shares details about the case and the new evidence that has come to light. The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "20:12",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. The program shares details about the case and the new evidence that has come to light. It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for.  "\n  },\n  {\n    "timecode": "20:28",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. The program shares details about the case and the new evidence that has come to light. The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "20:44",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain.  Jane King reveals that Zoran, her ex-husband, booked Revelle with a client named Boyan the night Revelle went missing. The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "20:56",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "21:12",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "21:28",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain. The program shares details about the case and the new evidence that has come to light.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "21:44",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. Jane King discusses the new evidence that has come to light, which has changed the focus of the investigation. Jane King\'s sister, Suellen Simpson, who has lived with the grief and uncertainty of the case, says that the new evidence has re-ignited hope for answers. "\n  },\n  {\n    "timecode": "22:00",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open.  The program shares more details about the case and the new evidence that has come to light.  "\n  },\n  {\n    "timecode": "22:16",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open.  The program shares more details about the case and the new evidence that has come to light.  "\n  },\n  {\n    "timecode": "22:32",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. The program shares details about the case and the new evidence that has come to light. It is reported that Zoran, Jane King\'s ex-husband, was the co-owner and main driver for the escort agency Revelle worked for.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "22:48",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open.  The program shares more details about the case and the new evidence that has come to light.  "\n  },\n  {\n    "timecode": "23:04",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "23:20",\n    "chapterSummary": "The 60 Minutes Australia program continues to discuss the disappearance of Revelle Balmain.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "23:36",\n    "chapterSummary": "The 60 Minutes Australia program investigates the disappearance of Revelle Balmain. Jane King discusses the new evidence that has come to light, which has changed the focus of the investigation. Jane King\'s sister, Suellen Simpson, who has lived with the grief and uncertainty of the case, says that the new evidence has re-ignited hope for answers.  The program shares more details about the case and the new evidence that has come to light.  "\n  },\n  {\n    "timecode": "23:52",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open.  The program shares more details about the case and the new evidence that has come to light. "\n  },\n  {\n    "timecode": "24:08",\n    "chapterSummary": "The 60 Minutes Australia program examines the potential connection between the Revelle Balmain case and the Church of Scientology. It is noted that the trial is the first that has brought the Church of Scientology into the open. The program shares more details about the case and the new evidence that has come to}]